In [39]:
from pandas import DataFrame, Series
import pandas as pd

`DataFrame`
2D data
- Table in RDBMS
- Table in an excel sheet

In [2]:
marks = {
    'Name': ['mehul', 'jane', 'jill'],
    'Physics': [93, 98, 99],
    'Chemistry': [100, 95, 90]
}

In [5]:
d1 = DataFrame(marks)
d1

    Name  Physics  Chemistry
0  mehul       93        100
1   jane       98         95
2   jill       99         90

In [8]:
print(type(d1))
print(d1.index)
print(d1.columns)

<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Physics', 'Chemistry'], dtype='object')

In [9]:
marks = {
    'Name': ['mehul', 'jane', 'jill'],
    'Physics': [93, 98, 99],
    'Chemistry': [100, 95, 90],
    'Roll': [10, 12, 13]
}

In [11]:
d2 = DataFrame(marks, index=marks['Roll'], columns=['Name', 'Physics', 'Chemistry'])
d2

     Name  Physics  Chemistry
10  mehul       93        100
12   jane       98         95
13   jill       99         90

In [16]:
# row level indexing
print(d2.loc[12])
print(d2.loc[[10, 13]])
print(d2.iloc[[0, -1]])

Name         jane
Physics        98
Chemistry      95
Name: 12, dtype: object
     Name  Physics  Chemistry
10  mehul       93        100
13   jill       99         90
     Name  Physics  Chemistry
10  mehul       93        100
13   jill       99         90

In [18]:
# column level indexing
print(d2['Physics'])
print(d2[['Name', 'Chemistry']])

10    93
12    98
13    99
Name: Physics, dtype: int64
     Name  Chemistry
10  mehul        100
12   jane         95
13   jill         90

In [20]:
# row + column indexing
print(d2.loc[[10, 13], 'Physics'])
print(d2.loc[[12, 13], ['Name', 'Chemistry']])

10    93
13    99
Name: Physics, dtype: int64
    Name  Chemistry
12  jane         95
13  jill         90

In [23]:
print(d2.iloc[[0, -1], [0, 2]])

     Name  Chemistry
10  mehul        100
13   jill         90

In [26]:
maths = {12: 100, 10: 95, 13: 97}
maths_series = Series(maths)
maths_series

12    100
10     95
13     97
dtype: int64

In [27]:
d2['Maths'] = maths_series
d2

     Name  Physics  Chemistry  Maths
10  mehul       93        100     95
12   jane       98         95    100
13   jill       99         90     97

In [28]:
d2['Total'] = d2['Physics'] + d2['Chemistry'] + d2['Maths']
d2

     Name  Physics  Chemistry  Maths  Total
10  mehul       93        100     95    288
12   jane       98         95    100    293
13   jill       99         90     97    286

In [32]:
#slicing
print(d2.iloc[:2])
print(d2.iloc[-2:])

print(d2.iloc[:2, 1:4])

# slicing + indexing
print(d2.iloc[-2:, [1, 3]])

     Name  Physics  Chemistry  Maths  Total
10  mehul       93        100     95    288
12   jane       98         95    100    293
    Name  Physics  Chemistry  Maths  Total
12  jane       98         95    100    293
13  jill       99         90     97    286
    Physics  Chemistry  Maths
10       93        100     95
12       98         95    100
    Physics  Maths
12       98    100
13       99     97

In [34]:
d3 = d2[['Physics', 'Chemistry', 'Maths']]
d3

    Physics  Chemistry  Maths
10       93        100     95
12       98         95    100
13       99         90     97

In [35]:
d3.mean(axis=0)

Physics      96.666667
Chemistry    95.000000
Maths        97.333333
dtype: float64

In [36]:
d3.sum(axis=1)

10    288
12    293
13    286
dtype: int64

In [37]:
d2

     Name  Physics  Chemistry  Maths  Total
10  mehul       93        100     95    288
12   jane       98         95    100    293
13   jill       99         90     97    286

In [38]:
other_marks = {
    'Roll': [13, 12, 10],
    'Verbal': [98, 99, 100],
    'Quant': [100, 90, 92]
}
d4 = DataFrame(other_marks, index=other_marks['Roll'], columns=['Verbal', 'Quant'])
d4

    Verbal  Quant
13      98    100
12      99     90
10     100     92

In [40]:
d5 = pd.merge(d2, d4, left_index=True, right_index=True)
d5

     Name  Physics  Chemistry  Maths  Total  Verbal  Quant
10  mehul       93        100     95    288     100     92
12   jane       98         95    100    293      99     90
13   jill       99         90     97    286      98    100

In [43]:
d5['Total'] = d5['Total'] + d5['Verbal'] + d5['Quant']
d5

     Name  Physics  Chemistry  Maths  Total  Verbal  Quant
10  mehul       93        100     95    864     100     92
12   jane       98         95    100    860      99     90
13   jill       99         90     97    880      98    100